12/data/attachments/2953dea5cffd8f06.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cd858865-2cf8-4dd2-bca7-fd02ca950a17</nif:username>
            <nif:friendToBeAdded>Cody_realize_Friend_16369_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>